Repository: oscarahalvorsen/masterproject
Catalog: datacollecting/MAALFRID/tmx/forsvaret.no.csv-en-nb.deduped.tmx
Source language: en
Languages: nb

source: The course will be taught to cadets in Bergen and in Oslo, in part via distance learning (digitally distributed), and in part in person on campus.
nb: Emnet gjennomføres for kadetter i Bergen og Oslo delvis digitalt og distribuert, og delvis oppmøtebaserte undervisning.

source: • exploit the opportunities modern operating systems (and associated standard libraries) offer to parallelise and synchronise computer programs both through the use of processes and threads
nb: • utnytte mulighetene moderne operativsystemer (og tilhørende standardbiblioteker) tilbyr for å parallellisere og synkronisere dataprogrammer både ved bruk av prosesser og tråder

source: • complete laboratory work and write project report
nb: • gjennomføre laboratoriearbeid og skrive prosjektrapport

source: Values: the cadets act in line with the values, even under demanding conditions.
nb: kadettene opptrer i tråd med verdigrunnlaget også under krevende forhold.

source: The course is based on ING1501 The Cyber Engineer's profession and ING1506 Computer communications
nb: Emnet bygger på ING1501 Cyberingeniørens profesjon og ING1506 Datakommunikasjon,

source: describe technological problems with mathematical models.
nb: beskrive teknologiske problem ved matematiske modeller.

source: Regulations, HSE and regulations for marine electrical installations.
nb: Forskrifter, HMS og regelverk for maritime elektriske anlegg.

source: Examples of use of digital signal processing in weapon and sensor systems.
nb: Eksempler på bruk av digital signalbehandling i våpen- og sensorsystemer.

source: How can the UN be understood from an international security policy perspective?
nb: Hvordan kan FN forstås i et internasjonalt sikkerhetspolitisk perspektiv?

source: • compose and solve simple differential equations
nb: • sette opp og løse enkle differensiallikninger

source: Understand how to plan and lead a tactical co-operation.
nb: Forstå hvordan man planlegger og leder en taktisk samvirkeoperasjon.

source: Chapter 1.9 Respond to navigational emergencies
nb: Kapittel 1.9 Handling ved navigasjonsuhell

source: This culminates in a deployment of up to one week's duration, which can provide cadets with a complex arena in which to turn theory into practical action.
nb: Dette munner ut i en deployeringsøvelse av inntil én ukes varighet noe som kan gi kadettene en kompleks arena hvor de kan omsette teori til praktisk handling.

source: Total numbers of pages in the syllabus is 1050.
nb: Totalt antall pensum er maksimalt 1050.

source: - Introduction of group work requirements during the course.
nb: Innføring av gruppevise arbeidskrav underveis i emnet.

source: In addition, the course will further develop the English skills of the cadets (both oral and written), as well as provide a basic introduction to how systematic physical exercise affects the body and the mental ability to carry out military operations.
nb: Emnet skal i tillegg videreutvikle kadettenes engelskkunnskaper og ferdigheter (muntlig og skriftlig), samt en grunnleggende innføring i hvordan systematisk fysisk trening har betydning for kroppen og den mentale evnen til å gjennomføre militære operasjoner.

source: • describe principles and applications network administration
nb: • beskrive prinsipper og anvendelse for nettverksadministrasjon

source: Contact tensions, dimensioning, life span.
nb: Kontaktspenninger, dimensjonering, levetid.

source: ) influence and put in place frameworks for the application of air power.
nb: ) påvirker og setter rammer for anvendelse av luftmakt.

source: Lectures, flipped classroom, tests, compulsory practical group assignments with report submissions, compulsory exercises and online tests.
nb: Forelesninger, «Flipped classroom» (omvendt klasserom), prøver, obligatoriske praktiske gruppeoppgaver med rapportinnlevering, obligatoriske øvinger og online-tester.

source: Maidenhead: Open University Press/McGraw-Hill, ch. 13 (interviews) and 14 (observation) (44 p.)
nb: Open University Press/McGraw-Hill, kap. 13 (intervjuer) og 14 (observasjon) (44 s.)

source: quote and manage references in accordance with good academic practice
nb: forklare forskjellen på kvalitative og kvantitative metoder og deres styrker og begrensninger

source: This part of the course introduces the scenario used for operations planning and the execution of Joint Effort during FOPS 2.
nb: I denne delen av emnet introduseres scenarioet som benyttes i fm operasjonsplanlegging og praksisarena Joint Effort under FOPS 2.

source: Discuss the political conditions and dynamics that affect your own mission resolution in a given operation.
nb: forklare hvordan rettslige, etiske, kulturelle, kommunikative og historiske forhold påvirker militær oppdragsløsning i et gitt operasjonsmiljø.

source: The purpose of the exercise is for the cadet to perform independently and maintain safe navigation by him or herself through practising a structured and methodical work approach.
nb: Hensikten med øvelsen er at kadetten skal være selvstendig og ivareta navigasjonssikkerheten selv ved å øve inn god struktur og arbeidsmetodikk.

source: Training on Statsråd Lehmkuhl, the school vessels and simulator
nb: Øvelser på Statsråd Lehmkuhl, skolefartøyene og simulator

source: Bachelor in military studies with specialisation in leadership – Seapower and Military Navigation
nb: Bachelor i militære studier med fordypning i ledelse - Sjømakt og militær navigasjon

source: (GSF-O), where the purpose is to ensure the cadets have the necessary basic skills to master the “demands of war” and lead a command, as well as survive on the battlefield.
nb: (GSF-O), der formålet er å sikre nødvendige basisferdigheter for å mestre "krigens krav" og føre kommando, samt overleve på stridsfeltet.

source: The course will provide the necessary knowledge within marine engineering to serve, maintain and supervise on vessels in the role of marine engineer and damage control officer in the Navy.
nb: Emnet skal gi nødvendig skipsteknisk kunnskap til å betjene, vedlikeholde og føre tilsyn med fartøyer i rollen som maskin- og havarioffiser i Marinen.

source: The teaching (2 hours per week) involves presentation and analysis with a focus on transferring relevant knowledge between different contexts, as well as the use of English-language methods and sources.
nb: Undervisningen (2 timer per uke) innebærer presentasjon og analyse med fokus på å overføre relevant læring mellom ulike kontekster, samt bruk av engelskspråklig metode og kilder.

source: carry out and process exhaust gas readings.
nb: gjennomføre og bearbeide avgassmålinger.

source: Manoeuvring tests and NATO requirements.
nb: Manøverprøver og NATO krav.

source: Through the use of various learning and reflection methods in the forefront, during and after major and minor practice arenas, individual and collective learning and development (learning skills) are strengthened.
nb: Ved bruk av forskjellige lærings- og refleksjonsmetoder i forkant, underveis og i etterkant av større og mindre praksisarenaer forsterkes individuell og kollektiv læring og utvikling (læringskompetanse).

source: explain the relationship between society, politics, and military power, using relevant examples from the period between 1750 and present day.
nb: forklare sammenhengen og påvirkningen mellom samfunn, politikk og militærmakt ved å vise til sentrale eksempler på slike sammenhenger og påvirkninger fra 1750 og fram til i dag

source: contribute to new thinking and innovative processes in MPN
nb: nytenkning og innovasjonsprosesser innen MPN

source: Military Navigation 3
nb: Militær navigasjon 3

source: understand and explain how operational planning in practice encompasses leadership, organisational knowledge, command and control, language (Norwegian and English, written and spoken)/international cooperation and operational management
nb: forstå og forklare hvordan operativ planlegging i praksis omfatter lederskap, organisasjonskunnskap, kommando og kontroll, språk (norsk og engelsk, skriftlig og muntlig) / internasjonalt samarbeid og virksomhetsstyring

source: Military requirements for stability when intact and damaged.
nb: Militære krav til intakt og skadestabilitet.

source: In addition to the military programme of professional study, which includes leadership and military power, the cadets acquire technical and operative engineering expertise in operational, management, operation and maintenance of weapon technology systems in the Navy.
nb: I tillegg til den militære profesjonsutdanningen, som inneholder lederskap og militærmakt, får kadettene teknisk og operativ ingeniørkompetanse innenfor operasjon, ledelse, drift og vedlikehold av våpentekniske systemer i Sjøforsvaret.

source: A total of approx. 60 teaching hours in the course of the semester.
nb: Totalt ca. 60 undervisningstimer over semesteret, samt ca.

source: apply technical knowledge and relevant experience to practical and theoretical issues and make informed choices as a navigator
nb: anvende faglig kunnskap og relevante erfaringer på praktiske og teoretiske problemstillinger og treffe begrunnede valg som navigatør.

source: The student is expected to learn PTC MathCad Prime to solve course exercises.
nb: Det er forventet at studenten lære seg PTC MathCad Prime for å løse oppgavene.

source: Student and supervisor will be submitted to the NDUC guidelines for guidance of the master thesis.
nb: Student og veileder vil bli forelagt FHS retningslinjer for veiledning av masteroppgaven.

source: understand your own role as MilGeo officer in a planning and decision-making process (PBP)
nb: forstå egen rolle som MilGeo-offiser i en plan- og beslutningsprosess (PBP)

source: INI-related concepts, doctrines and directives
nb: INI-relaterte konsepter, doktriner og direktiver

source: Work, learning and assessment forms
nb: Arbeids-, lærings-, og vurderingsformer

source: • perform calculations in Octave with algorithms (convolution, correlation, modulation, DFT and FFT) for digital signal processing
nb: • utføre beregninger i Octave med algoritmer (folding, korrelasjon, modulasjon, DFT og FFT) for digital signalbehandling

source: For the industry Technically, the course is conducted at the Air Force Technical School (LTSK) at Kjevik.
nb: For bransjen Teknisk gjennomføres emnet ved Luftforsvarets tekniske skole (LTSK) på Kjevik.

source: • arrange and calculate with formulas in discrete mathematics
nb: • sette opp og regne med formler i diskret matematikk

source: explain the research, trends and developments with consequences for military leadership and management.
nb: redegjøre for forskning, trender og utviklingstrekk med konsekvenser for militært lederskap og styring.

source: ) and what the key elements and concepts related to joint operational thinking are.
nb: ) og hva som er sentrale elementer og begreper knyttet til fellesoperativ tenkning.

source: Presentation of lines plans, calculation of hydrostatic data and coefficients, curve sheets
nb: Framstilling av linjetegning, beregning av hydrostatiske størrelser og koeffisienter, Kurveblad

source: Introduction to learning processes, experiential learning, supervision and writing.
nb: Innføring i læringsprosesser, erfaringslæring, veiledning og skriving.

source: Structure of marine electrical installations, production systems, distribution systems, emergency cable system, main and power distributing panels on naval vessels (Nansen-class frigates).
nb: Oppbygging av skipselektriske anlegg, produksjonssystemer, fordelingssystemer, nødkabelsystem, hoved- og fordelingstavler på marinefartøy (Nansenklassen fregatt).

source: explain theories, limitations and practical application of GIS
nb: forklare teorier, begrensninger og praktisk anvendelse av GIS

source: understanding of the role of the naval officer
nb: anvende faglig kunnskap og arbeide både selvstendig og i team

source: Chapter 1.1.1 Voyage planning and navigation for all conditions
nb: kapittel 1.1.1 Seilasplanlegging og navigering i alle forhold

source: describe control and regulation of marine turbo engines.
nb: beskrive kontroll og regulering av marine turbomaskiner.

source: The course covers the entire collection process, from identification of information needs, different collection methods, source assessment and structuring of data, including the establishment, operation and maintenance of a geodatabase.
nb: Emnet dekker hele innsamlingsprosessen, fra identifisering av informasjonsbehov, ulike innsamlingsmetoder, kildevurdering og strukturering av data, herunder etablering, drift og vedlikehold av en geodatabase.

source: Theme 2 directs focus to the operational and tactical levels.
nb: Tema 2 retter fokus mot det operasjonelle og taktiske nivået.

source: · Curriculum review using questions/discussions
nb: · Gjennomgang av pensum med bruk av spørsmål/diskusjoner

source: discuss operational problems, analysis and conclusion, both with specialists and the general public
nb: drøfte operasjonelle problemstillinger, analyser og konklusjoner, både med spesialister og allmennheten.

source: Theme 2 takes a closer look at how changes in the operating environment have affected the UN's approach to peacekeeping, including mandates, policies, principles, concepts and capabilities.
nb: Tema 2 ser nærmere på hvordan endringer i operasjonsmiljøet har påvirket FNs tilnærming til fredsbevaring, herunder mandater, policy, prinsipper, konsepter og kapabiliteter.

source: Lectures, compulsory project work and weekly assignments
nb: Forelesninger, obligatorisk prosjektarbeid og ukesoppgaver.

source: Completion of exercise “Winter Fusion.”
nb: Gjennomføring av øvelse «Winter Fusion».

source: The semester 4 weekend voyage comes towards the end of the semester, where the aim is to reinforce the training goals within radar navigation and prepare the cadet for the exam.
nb: Helgeseilasen semester 4 kommer mot slutten av semesteret hvor hensikten er å befeste øvingsmålene innen radar navigasjon og forberede kadetten mot eksamen.

source: For the 2018-2019 school year, these courses will follow FHS’s/CIS’s course descriptions and the regulations relating to admission, studies and examinations at the Norwegian Defence University College.
nb: For skoleåret 2018-2019 vil disse emnene følge FHS/CIS sine emnebeskrivelser og forskrift om opptak, studier og eksamen ved Forsvarets høgskole.

source: The course is based on ING1502 Mathematical models 1, ING1504 Physics and ING2501 Mathematical models 2 (the latter is prior knowledge for the spring semester in course ING2502).
nb: Emnet bygger på ING1502 Matematiske metoder 1, ING1504 Fysikk og ING2501 Matematiske metoder 2 (sistnevnte er forkunnskap til vårsemesteret i emnet ING2502).

source: The first physical session (three days) introduces operational logistics at the levels of political – strategic – operational – tactical.
nb: Første fysiske samling (tre dager) introduserer operativ logistikk på nivåene politisk – strategisk – operasjonelt – taktisk.

source: The intention is that this three-step approach will create a comprehensive education, and develop action skills with which to solve military missions in an international context.
nb: Intensjonen er at denne tredelte tilnærmingen vil skape en helhet i læringen, og utvikle handlingskompetanse for å løse militære oppdrag i en internasjonal kontekst.

source: demonstrate the use of remote control solutions for propulsion systems as well as engine systems and functions.
nb: demonstrere bruk av fjernkontroller for fremdriftsanlegg og maskinsystemer og -funksjoner.

source: After completing the course, the cadets will:
nb: Etter fullført emne skal kadettene:

source: • explain the relationship between decision-making, methodological competence and credibility as a military leader
nb: forklare forholdet mellom beslutningstaking, metodekompetanse og troverdighet som militær leder

source: Including, we discuss the role and significance of the UN Charter and the background to the basic principles of peacekeeping.
nb: Herunder diskuterer vi FN charterets rolle og betydning og bakgrunnen for de grunnleggende prinsippene for fredsbevaring.

source: Factors such as altitude, speed and range, operational tempo and span in levels, distinguish air power from both sea and land power, and provide guidance/pointers/coordinates on air operations and how these are organised and managed (command and control).
nb: Egenskaper som høyde, hastighet og rekkevidde, operasjonstempo og spenn i nivå, skiller luftmakten fra både sjø- og landmakt, og gir føringer på luftoperasjonene og hvordan disse organiseres og ledes (kommando og kontroll).

source: This course module will prepare cadets for professional practice as platoon and co-operation commanders for the Army.
nb: Delemnet skal forberede kadettene som profesjonsutøvere som troppsjef og samvirkeoffiser i Hæren.

source: • vary the performance of a telecommunication system by adjusting individual parameters in the system using Octave
nb: • variere prestasjonen til et telekommunikasjonssystem gjennom å justere enkeltparametere i systemet ved hjelp av Octave

source: Contribute constructively into operational planning and decision-making processes, as well as to the development of organization, training, material, leadership, teaching and interoperability.
nb: Bidra konstruktivt inn i operative plan- og beslutningsprosesser, samt til utvikling av organisasjon, trening og øving, materiell, ledelse, undervisning og interoperabilitet

source: • identify academic issues, discuss these, document, protect and present their work orally and in writing
nb: • identifisere faglige problemstillinger, drøfte disse, dokumentere, beskytte og presentere sitt arbeid muntlig og skriftlig

source: The course shall provide the cadet with knowledge in the field of marine propulsion machinery with emphasis on marine diesel engines.
nb: Emnet skal gi kadetten kunnskap innen marint framdriftsmaskineri med vekt på marine dieselmotorer.

source: Use their self-knowledge and be aware of own conduct, ways of thinking and emotions in relation to and in interaction with others
nb: Anvende sin selvinnsikt, og være bevisst egen atferd, tankemønster og emosjoner i relasjon til og i samspill med andre

source: Lectures, laboratory experiments, tests and compulsory exercises.
nb: Forelesninger, laboratorieeksperimenter, prøver og obligatorisk øving.

source: The Falklands War and Germany's attack on France in 1940 will be a backdrop for the module, and is used to exemplify theoretical concepts and expressions.
nb: Falklandskrigen og Tysklands angrep på Frankrike i 1940 vil ligge som et bakteppe, og brukes til eksemplifisering av teoretiske begreper og uttrykk.
